# -*- coding: utf-8 -*-
# !/usr/bin/env python3

"""
4.Переделать скрипт из задания 5.1b таким образом, чтобы, при запросе параметра, которого нет в словаре устройства,
отображалось сообщение „Такого параметра нет“. Задание относится только к параметрам устройств, не к самим устройствам.

Примечание:
Попробуйте набрать неправильное имя параметра или несуществующий параметр, чтобы увидеть какой будет результат.
А затем выполняйте задание.

Если выбран существующий параметр, вывести информацию о соответствующем параметре,указанного устройства.
Пример выполнения скрипта:

Введите имя устройства: r1
Введите имя параметра (ios, model, vendor, location, ip): ips
Такого параметра нет

Ограничение: нельзя изменять словарь london_co.
Все задания надо выполнять используя только пройденные темы. То есть эту задачу можно решить без использования условия if.
"""