# -*- coding: utf-8 -*-
# !/usr/bin/env python3

"""
Переделать скрипт из задания 3: вместо вывода на стандартный поток вывода, скрипт должен записать полученные строки в
файл.
Имена файлов нужно передавать как аргументы скрипту:
    • имя исходного файла конфигурации
    • имя итогового файла конфигурации
При этом, должны быть отфильтрованы строки, которые содержатся в списке ignore и строки, которые начинаются на „!“.
Ограничение: Все задания надо выполнять используя только пройденные темы.
ignore = ["duplex", "alias", "configuration"]
"""