# -*- coding: utf-8 -*-
# !/usr/bin/env python3

"""
Сделать копию скрипта задания 2.

Добавить проверку введенного IP-адреса. Адрес считается корректно заданным, если он:
    • состоит из 4 чисел (а не букв или других символов)
    • числа разделенны точкой
    • каждое число в диапазоне от 0 до 255
Если адрес задан неправильно, выводить сообщение: «Неправильный IP-адрес». Сообщение «Неправильный IP-адрес» должно
выводиться только один раз, даже если несколько пунктов выше не выполнены.
Ограничение: Все задания надо выполнять используя только пройденные темы.
"""