# -*- coding: utf-8 -*-
# !/usr/bin/env python3


"""
8.Преобразовать IP-адрес в переменной ip в двоичный формат и вывести на стандартный поток вывода вывод столбцами, таким
 образом:
    • первой строкой должны идти десятичные значения байтов
    • второй строкой двоичные значения
Вывод должен быть упорядочен также, как в примере:
    • столбцами
    • ширина столбца 10 символов (в двоичном формате надо добавить два пробела между столбцами для разделения октетов
      между собой)

Пример вывода для адреса 10.1.1.1:

10       1        1        1
00001010 00000001 00000001 00000001

Ограничение: Все задания надо выполнять используя только пройденные темы.

"""