# -*- coding: utf-8 -*-
# !/usr/bin/env python3

"""
Переделать скрипт из задания 5.1a таким образом, чтобы, при запросе параметра, отображался список возможных параметров.
Список параметров надо получить из словаря, а не прописывать вручную. Вывести информацию о соответствующем параметре,
указанного устройства.
Пример выполнения скрипта:

Введите имя устройства: r1
Введите имя параметра (location, vendor, model, ios, ip): ip
10.255.0.1

Введите имя устройства: sw1
Введите имя параметра (location, vendor, model, ios, ip, vlans, routing): ip
10.255.0.101

Ограничение: нельзя изменять словарь london_co.
Все задания надо выполнять используя только пройденные темы. То есть эту задачу можно
решить без использования условия if.
"""

