# -*- coding: utf-8 -*-
# !/usr/bin/env python3

"""
3.Получить из строки config такой список VLANов:

['1', '3', '10', '20', '30', '100']
Записать итоговый список в переменную result. (именно эта переменная будет проверятьсяв тесте) Полученный список result
вывести на стандартный поток вывода (stdout) с помощью print. Тут очень важный момент, что надо получить именно список
(тип данных), а не, например, строку, которая похожа на показанный список.
Ограничение: Все задания надо выполнять используя только пройденные темы.

config = "switchport trunk allowed vlan 1,3,10,20,30,100"
"""

config = "switchport trunk allowed vlan 1,3,10,20,30,100"