# -*- coding: utf-8 -*-
#!/usr/bin/env python3
'''
Задание 4.8

Преобразовать IP-адрес в двоичный формат и вывести на стандартный поток вывода вывод столбцами, таким образом:
- первой строкой должны идти десятичные значения байтов
- второй строкой двоичные значения

Вывод должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов

Пример вывода для адреса 10.1.1.1:
10        1         1         1
00001010  00000001  00000001  00000001

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

template = '''
IP address: {0}
{1:<8} {2:<8} {3:<8} {4:<8}
{1:<08b} {2:<08b} {3:<08b} {4:<08b}
'''

ip = '192.168.3.1'

Oct1,Oct2,Oct3,Oct4= ip.split('.')
print(template.format(ip,int(Oct1),int(Oct2),int(Oct3),int(Oct4)))
